Revit 2027 API
PipeSettings.FittingAnnotationSize Property
 The value of fitting annotation size.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FittingAnnotationSize { get; set; }
Public Property FittingAnnotationSize As Double
	Get
	Set
public:
property double FittingAnnotationSize {
	double get ();
	void set (double value);
}
member FittingAnnotationSize : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for dValue must be no more than 30000 feet in absolute value.
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace